clc;clear;close all;
%* ===============================================================
%* ###############################################################
%* 文件名: runme
%* 创建人: 哈尔滨工程大学 黄嘉铭 
%* 创建时间: 2023/11/30
%* 程序功能: OMP信道估计算法测试程序
%* 程序版本号: V1.0
%* ################################################################
%* ================================================================
K = 2;                              %多径条数
hn = [1,0,0.7];                     %设置信道（编码信道）
N_train = 255;                      %训练序列长度

ms=idinput((N_train),'prbs')';      %生成m序列ms
Train = [ms,ms];                    %产生CP（首尾相同）
rec = conv(Train,hn);               %经过信道
rec_train = rec(length(ms)+1:length(ms)+length(ms));%截取接收训练序列
[hn_hat,~] = Cest_OMP(ms,rec_train,K);%OMP信道估计

LS = sum((hn_hat - hn).^2);
disp(['平方误差为：',num2str(LS)]);